# ScopeBoxBehindSection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SectionViewFailures..::..ScopeBoxBehindSection Property
BuiltInFailures..::..SectionViewFailures Class See Also
---
Section may not be associated to a scope box which lies behind it.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ScopeBoxBehindSection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ScopeBoxBehindSection As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ScopeBoxBehindSection {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SectionViewFailures Class
Autodesk.Revit.DB Namespace